Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 16)]              0         
_________________________________________________________________
dense (Dense)                (None, 256)               4096      
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65536     
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 256       
=================================================================
Total params: 69,888
Trainable params: 69,888
Non-trainable params: 0
_________________________________________________________________
