Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Data (InputLayer)               [(None, 10)]         0                                            
__________________________________________________________________________________________________
Data_NaN (InputLayer)           [(None, 18)]         0                                            
__________________________________________________________________________________________________
de_natureza_juridica (InputLaye [(None, 33)]         0                                            
__________________________________________________________________________________________________
de_ramo (InputLayer)            [(None, 33)]         0                                            
__________________________________________________________________________________________________
fl_rm (InputLayer)              [(None, 2)]          0                                            
__________________________________________________________________________________________________
natureza_juridica_macro (InputL [(None, 6)]          0                                            
__________________________________________________________________________________________________
sg_uf (InputLayer)              [(None, 6)]          0                                            
__________________________________________________________________________________________________
setor (InputLayer)              [(None, 6)]          0                                            
__________________________________________________________________________________________________
nm_divisao (InputLayer)         [(None, 86)]         0                                            
__________________________________________________________________________________________________
nm_segmento (InputLayer)        [(None, 22)]         0                                            
__________________________________________________________________________________________________
fl_spa (InputLayer)             [(None, 3)]          0                                            
__________________________________________________________________________________________________
fl_antt (InputLayer)            [(None, 3)]          0                                            
__________________________________________________________________________________________________
fl_veiculo (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
fl_optante_simples (InputLayer) [(None, 3)]          0                                            
__________________________________________________________________________________________________
fl_optante_simei (InputLayer)   [(None, 3)]          0                                            
__________________________________________________________________________________________________
sg_uf_matriz (InputLayer)       [(None, 28)]         0                                            
__________________________________________________________________________________________________
de_saude_tributaria (InputLayer [(None, 7)]          0                                            
__________________________________________________________________________________________________
de_saude_rescencia (InputLayer) [(None, 3)]          0                                            
__________________________________________________________________________________________________
fl_simples_irregular (InputLaye [(None, 3)]          0                                            
__________________________________________________________________________________________________
nm_meso_regiao (InputLayer)     [(None, 20)]         0                                            
__________________________________________________________________________________________________
nm_micro_regiao (InputLayer)    [(None, 74)]         0                                            
__________________________________________________________________________________________________
fl_passivel_iss (InputLayer)    [(None, 3)]          0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 375)          0           Data[0][0]                       
                                                                 Data_NaN[0][0]                   
                                                                 de_natureza_juridica[0][0]       
                                                                 de_ramo[0][0]                    
                                                                 fl_rm[0][0]                      
                                                                 natureza_juridica_macro[0][0]    
                                                                 sg_uf[0][0]                      
                                                                 setor[0][0]                      
                                                                 nm_divisao[0][0]                 
                                                                 nm_segmento[0][0]                
                                                                 fl_spa[0][0]                     
                                                                 fl_antt[0][0]                    
                                                                 fl_veiculo[0][0]                 
                                                                 fl_optante_simples[0][0]         
                                                                 fl_optante_simei[0][0]           
                                                                 sg_uf_matriz[0][0]               
                                                                 de_saude_tributaria[0][0]        
                                                                 de_saude_rescencia[0][0]         
                                                                 fl_simples_irregular[0][0]       
                                                                 nm_meso_regiao[0][0]             
                                                                 nm_micro_regiao[0][0]            
                                                                 fl_passivel_iss[0][0]            
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           24064       concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 64)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 32)           2080        dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 32)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 6)            198         dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           224         dense_7[0][0]                    
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 32)           0           dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           2112        dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 64)           0           dense_9[0][0]                    
__________________________________________________________________________________________________
Data_out (Dense)                (None, 10)           650         dropout_7[0][0]                  
__________________________________________________________________________________________________
Data_NaN_out (Dense)            (None, 9)            585         dropout_7[0][0]                  
__________________________________________________________________________________________________
de_natureza_juridica_out (Dense (None, 33)           2145        dropout_7[0][0]                  
__________________________________________________________________________________________________
de_ramo_out (Dense)             (None, 33)           2145        dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_rm_out (Dense)               (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
natureza_juridica_macro_out (De (None, 6)            390         dropout_7[0][0]                  
__________________________________________________________________________________________________
sg_uf_out (Dense)               (None, 6)            390         dropout_7[0][0]                  
__________________________________________________________________________________________________
setor_out (Dense)               (None, 5)            325         dropout_7[0][0]                  
__________________________________________________________________________________________________
nm_divisao_out (Dense)          (None, 85)           5525        dropout_7[0][0]                  
__________________________________________________________________________________________________
nm_segmento_out (Dense)         (None, 21)           1365        dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_spa_out (Dense)              (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_antt_out (Dense)             (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_veiculo_out (Dense)          (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_optante_simples_out (Dense)  (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_optante_simei_out (Dense)    (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
sg_uf_matriz_out (Dense)        (None, 27)           1755        dropout_7[0][0]                  
__________________________________________________________________________________________________
de_saude_tributaria_out (Dense) (None, 6)            390         dropout_7[0][0]                  
__________________________________________________________________________________________________
de_saude_rescencia_out (Dense)  (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_simples_irregular_out (Dense (None, 2)            130         dropout_7[0][0]                  
__________________________________________________________________________________________________
nm_meso_regiao_out (Dense)      (None, 19)           1235        dropout_7[0][0]                  
__________________________________________________________________________________________________
nm_micro_regiao_out (Dense)     (None, 73)           4745        dropout_7[0][0]                  
__________________________________________________________________________________________________
fl_passivel_iss_out (Dense)     (None, 2)            130         dropout_7[0][0]                  
==================================================================================================
Total params: 51,493
Trainable params: 51,493
Non-trainable params: 0
__________________________________________________________________________________________________
